docs: didactic overhaul of README structure & content
